# Static checker for GitHub Actions workflow files
brew "actionlint"
# Download with resuming and segmented downloading
brew "aria2"
# Agent orchestration and automation tool
brew "ansible"
# Improved shell history for zsh, bash, fish and nushell
brew "atuin"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# New way to see and navigate directory trees
brew "broot"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Command-line Interface File Manager
brew "clifm"
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima"
# Multi-shell completion tool
brew "carapace"
# Zstandard is a real-time compression algorithm
brew "zstd"
# Lint commit messages according to a commit convention
brew "commitlint"
# Load/unload environment variables based on $PWD
brew "direnv"
# Pack, ship and run any application as a lightweight container
brew "docker", link: false
# Dotfile manager and templater written in rust
brew "dotter"
# Pluggable and configurable code formatting platform written in Rust
brew "dprint"
# View disk space usage and delete unwanted data, fast
brew "dua-cli"
# Disk Usage/Free Utility - a better 'df' alternative
brew "duf"
# Backs up your work automatically via Git commits
brew "dura"
# More intuitive version of du in rust
brew "dust"
# Run arbitrary commands when files change
brew "entr"
# Multi-threaded file-tree visualizer and disk usage analyzer
brew "erdtree"
# Modern, maintained replacement for ls
brew "eza"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Simple, fast and user-friendly alternative to find
brew "fd"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# General-purpose fuzzy finder
brew "fzf"
# Terminal JSON viewer
brew "fx"
# Disk usage analyzer with console interface written in Go
brew "gdu"
# GitHub command-line tool
brew "gh"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Audit git repos for secrets
brew "gitleaks"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Fast linters runner for Go
brew "golangci-lint"
# Functions like rm but with the ability to restore files
brew "gomi"
# CLI for Drive, Gmail, Calendar, Sheets, Docs, Chat, Admin, and more
brew "googleworkspace-cli"
# Command-line tool for generating regular expressions
brew "grex"
# Make JSON greppable
brew "gron"
# Post-modern modal text editor
brew "helix"
# Simple zero-configuration command-line HTTP server
brew "http-server"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Configurable static site generator
brew "hugo"
# Run and Test HTTP Requests with plain text and curl
brew "hurl"
# Command-line benchmarking tool
brew "hyperfine"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# JQ clone focussed on correctness, speed, and simplicity
brew "jaq"
# JSON CLI output tool
brew "jc"
# Git-compatible distributed version control system
brew "jj"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Like gofmt, but for JSON files
brew "jsonfmt"
# Julia installer and version multiplexer
brew "juliaup"
# Handy way to save and run project-specific commands
brew "just"
# User-friendly front-end to ssh-agent(1)
brew "keychain"
# Lazier way to manage everything docker
brew "lazydocker"
# Simple terminal UI for git commands
brew "lazygit"
# CLI for SQLite Databases with auto-completion and syntax highlighting
brew "litecli"
# Find what models run on your hardware
brew "llmfit"
# Package manager for the Lua programming language
brew "luarocks"
# Easily rename multiple files using your text editor
brew "massren"
# CLI for Mermaid library
brew "mermaid-cli"
# Modern and intuitive terminal-based text editor
brew "micro"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# CLI for MySQL with auto-completion and syntax highlighting
brew "mycli"
# Interactive cheatsheet tool for the command-line
brew "navi"
# NCurses Disk Usage
brew "ncdu"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Command-line tool to format Nix language code
brew "nixfmt"
# Create, run, and share large language models (LLMs)
brew "ollama"
# Command-line Git information tool
brew "onefetch"
# Painless compression and decompression for your terminal
brew "ouch"
# Command-line tool to generate, analyze, convert and manipulate colors
brew "pastel"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Fast Git hook manager written in Rust, drop-in alternative to pre-commit
brew "prek"
# Command-line tool for managing long-running shell commands
brew "pueue"
# Tools for and transforming and inspecting PDF files
brew "qpdf"
# Fast, efficient and secure backup program
brew "restic"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Prevent committing secret keys into your source code
brew "ripsecrets"
# Utility that provides fast incremental file transfer
brew "rsync"
# Powerful, clean, object-oriented scripting language
brew "ruby", link: false
# Extremely fast Python linter, written in Rust
brew "ruff"
# Markdown Linter and Formatter written in Rust
brew "rumdl"
# Rust toolchain installer
brew "rustup"
# Fast and accurate code counter with complexity and COCOMO estimates
brew "scc"
# Intuitive find & replace CLI
brew "sd"
# Cross-shell prompt for astronauts
brew "starship"
# Lints and suggestions for the nix programming language
brew "statix"
# Opinionated Lua code formatter
brew "stylua"
# Log file highlighter
brew "tailspin"
# TOML toolkit written in Rust
brew "taplo"
# Terminal multiplexer
brew "tmux"
# Very fast implementation of tldr in Rust
brew "tealdeer"
# General purpose fuzzy finder TUI
brew "television"
# Powerful free data recovery utility
brew "testdisk"
# Terraform version manager inspired by rbenv
brew "tfenv"
# Program that allows you to count code, quickly
brew "tokei"
# Upgrade all the things
brew "topgrade"
# Command-line translator using Google Translate and more
brew "translate-shell"
# One CLI to format the code tree
brew "treefmt"
# Extremely fast Python type checker, written in Rust
brew "ty"
# Source code spell checker
brew "typos-cli"
# Markup-based typesetting system
brew "typst"
# Beautiful and reliable typst code formatter
brew "typstyle"
# CLI time zone visualizer
brew "tz"
# Cross-platform Rust rewrite of the GNU coreutils
brew "uutils-coreutils"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Generator for LS_COLORS with support for multiple color themes
brew "vivid"
# Successor of GNU Wget, a file and recursive website downloader
brew "wget2"
# Extensible command-line tool to format YAML files
brew "yamlfmt"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Pluggable terminal workspace, with terminal multiplexer as the base feature
brew "zellij"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Agent orchestration platform
cask "antigravity"
# Terminal interface for Antigravity agents
cask "antigravity-cli"
# Anthropic's official Claude AI desktop app
cask "claude"
# Terminal-based AI coding assistant
cask "claude-code"
# Brings the power of Copilot coding agent directly to your terminal
cask "copilot-cli"
cask "font-jetbrains-mono-nerd-font"
cask "font-maple-mono-nl-nf"
cask "font-roboto"
cask "font-source-code-pro"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "gcloud-cli"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Desktop client for GitHub repositories
cask "github"
# Web browser
cask "google-chrome"
# Client for the Google Drive storage service
cask "google-drive"
# GPU-based terminal emulator
cask "kitty"
# Privacy-first, open-source platform for knowledge sharing and management
cask "logseq"
# Clipboard manager
cask "maccy"
# Visual diff and merge tool
cask "meld"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Control your tools with a few keystrokes
cask "raycast"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Open-source code editor
cask "visual-studio-code"
# Multiplayer code editor
cask "zed"
vscode "aaron-bond.better-comments"
vscode "akamud.vscode-theme-onedark"
vscode "asciidoctor.asciidoctor-vscode"
vscode "azemoh.one-monokai"
vscode "bbenoist.nix"
vscode "betterthantomorrow.calva"
vscode "betterthantomorrow.calva-spritz"
vscode "bierner.markdown-mermaid"
vscode "bmalehorn.vscode-fish"
vscode "cameron.vscode-pytest"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "charliermarsh.ruff"
vscode "chrisdias.vscode-opennewinstance"
vscode "christian-kohler.path-intellisense"
vscode "corker.vscode-micromamba"
vscode "crystal-lang-tools.crystal-lang"
vscode "dart-code.dart-code"
vscode "davidanson.vscode-markdownlint"
vscode "donjayamanne.githistory"
vscode "dontshavetheyak.groovy-guru"
vscode "drblury.protobuf-vsc"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "editorconfig.editorconfig"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "exiasr.hadolint"
vscode "fabiospampinato.vscode-diff"
vscode "foam.foam-vscode"
vscode "formulahendry.code-runner"
vscode "foxundermoon.shell-format"
vscode "george-alisson.html-preview-vscode"
vscode "github.github-vscode-theme"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "grapecity.gc-excelviewer"
vscode "hangxingliu.vscode-systemd-support"
vscode "hashicorp.hcl"
vscode "hashicorp.terraform"
vscode "humao.rest-client"
vscode "hyunkyunmoon.gzipdecompressor"
vscode "iliazeus.vscode-ansi"
vscode "jakebecker.elixir-ls"
vscode "james-yu.latex-workshop"
vscode "janisdd.vscode-edit-csv"
vscode "julialang.language-julia"
vscode "kevinrose.vsc-python-indent"
vscode "maarti.jenkins-doc"
vscode "mechatroner.rainbow-csv"
vscode "medo64.render-crlf"
vscode "mikestead.dotenv"
vscode "mjmcloug.vscode-elixir"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.flake8"
vscode "ms-python.isort"
vscode "ms-python.mypy-type-checker"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.datawrangler"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vsliveshare.vsliveshare"
vscode "naumovs.color-highlight"
vscode "nicolasvuillamy.vscode-groovy-lint"
vscode "njpwerner.autodocstring"
vscode "oderwat.indent-rainbow"
vscode "pascalreitermann93.vscode-yaml-sort"
vscode "pkief.material-icon-theme"
vscode "rafaelmaiolla.diff"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "reditorsupport.r"
vscode "reditorsupport.r-syntax"
vscode "rubymaniac.vscode-direnv"
vscode "rust-lang.rust-analyzer"
vscode "ryu1kn.partial-diff"
vscode "saratravi.elixir-formatter"
vscode "scala-lang.scala"
vscode "scalameta.metals"
vscode "shardulm94.trailing-spaces"
vscode "shopify.ruby-lsp"
vscode "sidneys1.gitconfig"
vscode "slevesque.vscode-zipexplorer"
vscode "snyk-security.snyk-vulnerability-scanner"
vscode "streetsidesoftware.code-spell-checker"
vscode "tamasfe.even-better-toml"
vscode "timonwong.shellcheck"
vscode "tomoki1207.pdf"
vscode "tsandall.opa"
vscode "vadimcn.vscode-lldb"
vscode "vscjava.vscode-gradle"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "waderyan.gitblame"
vscode "wayou.vscode-todo-highlight"
vscode "wengerk.highlight-bad-chars"
vscode "wholroyd.jinja"
vscode "xoronic.pestfile"
vscode "yzhang.markdown-all-in-one"
vscode "ziglang.vscode-zig"
