tap "caarlos0/tap"
tap "nikitabobko/tap"
brew "atuin"
brew "bat"
brew "broot"
brew "btop"
brew "carapace"
brew "clifm"
brew "sqlite"
brew "python@3.13"
brew "codespell"
brew "direnv"
brew "diskus"
brew "dotter"
brew "dua-cli"
brew "duf"
brew "dura"
brew "dust"
brew "entr"
brew "erdtree"
brew "eza"
brew "fastfetch"
brew "fd"
brew "fish"
brew "fx"
brew "gdu"
brew "gh"
brew "git"
brew "git-delta"
brew "go"
brew "gomi"
brew "grex"
brew "gron"
brew "helix"
brew "node"
brew "http-server"
brew "httpie"
brew "hurl"
brew "hyperfine"
brew "ipython"
brew "jaq"
brew "jc"
brew "jj"
brew "jless"
brew "jq"
brew "juliaup"
brew "just"
brew "lazydocker"
brew "lazygit"
brew "litecli"
brew "massren"
brew "micro"
brew "mycli"
brew "navi"
brew "zstd"
brew "ncdu"
brew "neofetch"
brew "neovim"
brew "oha"
brew "ollama"
brew "onefetch"
brew "ouch"
brew "pastel"
brew "pre-commit"
brew "pueue"
brew "ripgrep"
brew "rsync"
brew "rustup"
brew "scc"
brew "sd"
brew "starship"
brew "tailspin"
brew "taplo"
brew "tealdeer"
brew "tfenv"
brew "tokei"
brew "topgrade"
brew "translate-shell"
brew "treefmt"
brew "typos-cli"
brew "typst"
brew "tz"
brew "uutils-coreutils"
brew "uv"
brew "vivid"
brew "wget2"
brew "yazi"
brew "yq"
brew "zellij"
brew "zenith"
brew "zoxide"
brew "caarlos0/tap/jsonfmt"
cask "aerospace"
cask "espanso"
cask "font-jetbrains-mono-nerd-font"
cask "ghostty"
cask "gimp"
cask "github"
cask "google-chrome"
cask "google-cloud-sdk"
cask "kitty"
cask "libreoffice"
cask "logseq"
cask "maccy"
cask "meld"
cask "obsidian"
cask "raycast"
cask "slack"
cask "spotify"
cask "vagrant"
cask "visual-studio-code"
cask "wezterm"
cask "zed"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-pull-request-github"
vscode "ms-azuretools.vscode-containers"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "vscodevim.vim"
