antibody
bedtools
bluez-firmware
broot
ctop
cytoscape
drawio-desktop
dropbox-cli
exa-git
fpp-git
fuse-zip
git-cola
git-extras
google-chrome
gotop
gron-bin
hyperfine
lab
massren
mdcat
mhwd-i2c-syna3602
neovim-gtk-git
oni
pacvim-git
pulse-secure
rstudio-desktop-bin
samtools
shrinkpdf
skypeforlinux-stable-bin
universal-ctags-git
watchman
weka
zoom
zotero
zulip-electron-bin
