antibody
bedtools
ctop
cytoscape
drawio-desktop
dropbox-cli
fpp-git
google-chrome
gron-bin
massren
mhwd-i2c-syna3602
neovim-gtk-git
oni
pacvim-git
pulse-secure
rstudio-desktop-bin
samtools
shrinkpdf
skypeforlinux-stable-bin
watchman
zoom
zotero
zulip-electron-bin
