accountsservice
acpi
acpid
alacritty
amd-ucode
ansible-lint
arandr
aria2
artwork-i3
asciidoc
aspell-en
atop
autoconf
automake
axel
b43-fwcutter
baobab
bat
bind-tools
bison
blueman
bluez-tools
bluez-utils
bmenu
calibre
cheese
clipit
cmake
cmus
code
cpupower
crda
create_ap
crystal
deluge
dfc
dhclient
dhcpcd
dia
diff-so-fancy
diskus
docker-compose
dos2unix
downgrade
dstat
ecryptfs-utils
efibootmgr
epdfview
evince
exfat-utils
f2fs-tools
fakeroot
fd
ffmpegthumbnailer
filezilla
firefox-developer-edition
fish
gcc-fortran
gcolor2
gephi
gimp
gimp-help-en
gitg
gnome-bluetooth
gnome-screenshot
go
gparted
grc
grub-theme-manjaro-dev
gst-libav
gst-plugins-ugly
gthumb
gtksourceview-pkgbuild
gucharmap
gufw
gvfs-afc
gvfs-google
gvfs-gphoto2
gvfs-mtp
gvfs-smb
gvim
haveged
hexchat
htop
httpie
hub
hugo
hyphen-en
igraph
inkscape
intel-compute-runtime
intel-ucode
iputils
ipw2100-fw
ipw2200-fw
ipython
isousb
jfsutils
julia-docs
keepassxc
kvantum-manjaro
lib32-flex
lib32-libva-vdpau-driver
lib32-mesa-demos
lib32-mesa-vdpau
lib32-vulkan-intel
lib32-vulkan-radeon
libdvdcss
libfbclient
libgpod
libreoffice-fresh
libva-mesa-driver
libva-vdpau-driver
licenses
light
lightdm-settings
linux414-r8168
linux419-r8168
linux420-r8168
linux50-r8168
logrotate
lsscsi
lxappearance
lxinput
macchanger
maia-console
make
man-db
man-pages
manjaro-alsa
manjaro-browser-settings
manjaro-firmware
manjaro-hello
manjaro-hotfixes
manjaro-release
manjaro-settings-manager-notifier
manjaro-system
markdown_previewer
meld
memtest86+
mesa-vdpau
mkinitcpio-openswap
mlocate
moc
modemmanager
morc_menu
mosh
mousepad
mpv
mtr
nano
ncdu
neofetch
netctl
network-manager-applet
networkmanager-openconnect
networkmanager-openvpn
networkmanager-pptp
networkmanager-vpnc
newsboat
nfs-utils
npm
nss-mdns
ntp
numlockx
onboard
open-fuse-iso
opencl-headers
openshot
opera
os-prober
otf-fira-code
p7zip
pamac-gtk
pamixer
parallel
patch
patchutils
pavucontrol
pbzip2
pcmanfm-gtk3
pdfpc
perl-anyevent-i3
perl-file-mimeinfo
perl-lwp-protocol-https
perl-term-readkey
pigz
pixz
pkgconf
playerctl
polkit-gnome
powertop
progress
pv
pygmentize
python-neovim
python-pip
python-sphinx
python-virtualenv
python2-pip
qt5-styleplugins
qt5-translations
qt5ct
ranger
redshift
reiserfsprogs
rofi
rustup
s-nail
sbxkb
screen
screenfetch
seahorse
shards
shellcheck
spectre-meltdown-checker
speedtest-cli
sshfs
stow
strace
stress
subversion
syncthing-gtk
syslog-ng
sysstat
systemd-sysvcompat
telegram-desktop
terminator
terminus-font
termite
testdisk
texlive-bibtexextra
texlive-latexextra
texlive-science
thunderbird-i18n-en-us
tig
time
tk
tldr
tlp
tmux
tokei
trash-cli
tree
ttf-inconsolata
ttf-indic-otf
udevil
udiskie
unrar
urlscan
vagrant
vertex-maia-themes
vi
vibrancy-icons-teal
viewnior
vifm
vimiv
virtualbox
vivid
vlc
volumeicon
vulkan-intel
vulkan-radeon
w3m
which
wine-mono
wine_gecko
wireshark-qt
wmctrl
wmutils
xarchiver
xautolock
xcape
xcursor-chameleon-pearl
xcursor-maia
xdg-su
xdotool
xf86-input-elographics
xf86-input-evdev
xf86-input-keyboard
xf86-input-mouse
xf86-input-void
xf86-video-amdgpu
xf86-video-ati
xf86-video-intel
xf86-video-nouveau
xfburn
xfce4-power-manager
xmlto
xorg-server
xorg-server-xvfb
xorg-twm
xorg-xbacklight
xorg-xev
xorg-xhost
xorg-xinit
xorg-xkill
xterm
yamllint
yarn
yay
zathura-pdf-mupdf
zsh
